================================================================
class dicer
{
	____________________________________________________________
	private:
	
	bool boolen = false;
	T *item = new T [];
	T count;
	____________________________________________________________
	public:
	
	dicer () : count(0) {}
	
	bool append 
	{	
		for (T count = 0; count < 15; count++)
			{
			std::cout << "Введите число от 1 до 6" std::endl;
			std::cin >> drop;
			std::cout << "выпало число" << drop << std::endl;
			item[i] = drop;
			boolen = count < 15;
			};
	};
	void clear{
		delete [] item;
	};
	____________________________________________________________
};
================================================================
